int a[10][10][10][10];
int main()
{
    int i,j,k,l,t1,t2,t3;
    /*
    上面是考察正确性的。
    */
    for (i=0;i<10;i++)
    {
        t1=a[i];
        for (j=0;j<10;j++)
        {
            t2=a[i][j];
            for (k=0;k<10;k++)
            {
                t3=a[i][j][k];
                for (l=0;l<10;l++)
                {
                    a[i][j][k][l]=i+j+k+l;
                }
            }
        }
    }
    printf("%d\n",a[5][5][5][5]);
    return 0;
    /*可以考察是否循环展开优化，
    以及值编号优化（i,j,k,l 循环的时候，a[i][j][k][l]的寻址要计算多次
    ，值编号之后就只用1次，t=i*1000+j*100+k*10; t1=t+l; *t1=...）
    */
	return 0;
}

